# Reading & Writing csv files As DataFrame (Pandas)

In [15]:
#Reading & writing - Using pandas
import pandas as pd

In [16]:
df = pd.read_csv('https://github.com/dayanandv/Data-Science/raw/main/dataset/CSV_EX_3.csv')

In [17]:
df

  Bedroom; Sq. foot; Locality; Price ($)
0                  2; 1500; Good; 300000
1                  3; 1300; Fair; 240000
2             3; 1900; Very good; 450000
3                   3; 1850; Bad; 280000
4                  2; 1640; Good; 310000

In [46]:
type(df) # It is a dataframe

pandas.core.frame.DataFrame

In [18]:
# write
df.to_csv('C:/Users/pn_kumar/Desktop/Classes/2022-23Odd/19CSE304FoDS/data/CSV_EX_3.csv')

In [42]:
df1 = pd.read_csv('https://github.com/dayanandv/Data-Science/raw/main/dataset/CSV_EX_1.csv')

In [47]:
# write
df1.to_csv('C:/Users/pn_kumar/Desktop/Classes/2022-23Odd/19CSE304FoDS/data/CSV_EX_1.csv')

In [48]:
df1

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [26]:
# for changing to a directory, import library "Operating Systems" i.e., import os
import os

In [32]:
os.chdir('C:/Users/pn_kumar/Desktop/Classes/2022-23Odd/19CSE304FoDS/data')

In [28]:
!dir (! is a OS command)

 Volume in drive C has no label.
 Volume Serial Number is 6AAD-4BFC

 Directory of C:\Users\pn_kumar\Desktop\Classes\2022-23Odd\19CSE304FoDS\data

09/01/2022  01:26 PM    <DIR>          .
09/01/2022  01:26 PM    <DIR>          ..
09/01/2022  01:26 PM               160 CSV_EX_1.csv
09/01/2022  01:25 PM               170 CSV_EX_3.csv
               2 File(s)            330 bytes
               2 Dir(s)   9,141,850,112 bytes free

In [51]:
!type CSV_EX_1.csv

,Bedroom, Sq. foot, Locality, Price ($)
0,2,1500, Good,300000
1,3,1300, Fair,240000
2,3,1900, Very good,450000
3,3,1850, Bad,280000
4,2,1640, Good,310000

In [58]:
df1 = pd.read_csv('CSV_EX_1.csv')
df1

   Unnamed: 0  Bedroom   Sq. foot    Locality   Price ($)
0           0        2       1500        Good      300000
1           1        3       1300        Fair      240000
2           2        3       1900   Very good      450000
3           3        3       1850         Bad      280000
4           4        2       1640        Good      310000

In [60]:
df2 = pd.read_csv("CSV_EX_1.csv", header=None)
df2

     0        1          2           3           4
0  NaN  Bedroom   Sq. foot    Locality   Price ($)
1  0.0        2       1500        Good      300000
2  1.0        3       1300        Fair      240000
3  2.0        3       1900   Very good      450000
4  3.0        3       1850         Bad      280000
5  4.0        2       1640        Good      310000

In [62]:
#If you wish to change headings of columns
df3 = pd.read_csv("CSV_EX_1.csv", names=['BR','Sqft', 'Locality','Price'])
df3

          BR       Sqft    Locality       Price
NaN  Bedroom   Sq. foot    Locality   Price ($)
0.0        2       1500        Good      300000
1.0        3       1300        Fair      240000
2.0        3       1900   Very good      450000
3.0        3       1850         Bad      280000
4.0        2       1640        Good      310000

In [64]:
df4 = pd.read_csv('CSV_EX_1.csv')
df4

   Unnamed: 0  Bedroom   Sq. foot    Locality   Price ($)
0           0        2       1500        Good      300000
1           1        3       1300        Fair      240000
2           2        3       1900   Very good      450000
3           3        3       1850         Bad      280000
4           4        2       1640        Good      310000

In [68]:
#If you wish to remove the redundant column1
df5 = pd.read_csv("CSV_EX_1.csv", usecols=range(1,5))
df5

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [71]:
df6 = pd.read_csv('CSV_EX_1.csv',usecols=range(1,5), skiprows=2)
df6

   3  1300        Fair  240000
0  3  1900   Very good  450000
1  3  1850         Bad  280000
2  2  1640        Good  310000

In [72]:
#read only first 3
df7 = pd.read_csv('CSV_EX_1.csv', nrows=3)
df7

   Unnamed: 0  Bedroom   Sq. foot    Locality   Price ($)
0           0        2       1500        Good      300000
1           1        3       1300        Fair      240000
2           2        3       1900   Very good      450000